
var ctx=document.getElementById("c1");
var c1=new Chart(ctx,{
  //type:'line',//哪种类型
  type:'bar',
  //type:'pie',
  data:{//x坐标项目
    labels:['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月','12月'],
    datasets:[{
      label:'消费情况',//标题
      data:[3500,2500,2000,1600,700,400,900,2505,1600,1200,110,1500],//y坐标柱状图
      backgroundColor:[
        'rgba(255,99,132,0.2)',
        'rgba(100,110,90,0.2)',
        'rgba(54,200,235,0.2)',
        'rgba(255,30,86,0.2)',
        'rgba(255,102,102,0.2)',
        'rgba(101,99,135,0.2)',
        'rgba(77,230,32,0.2)',
        'rgba(63,180,105,0.2)',
        'rgba(88,150,50,0.2)',
        'rgba(200,180,86,0.2)',
        'rgba(100,60,105,0.2)',
        'rgba(88,120,143,0.2)',
        'rgba(255,180,56,0.2)',
      ],
      borderColor:[
        'rgba(120,206,132,1)',
        'rgba(105,89,132,1)',
        'rgba(55,162,235,1)',
        'rgba(101,99,102,1)',
        'rgba(44,108,132,1)',
        'rgba(36,99,132,1)',
        'rgba(255,100,132,1)',
      ],
      options:{
        scales:{
          yAxes:[{
            ticks:{
              beginAtZero:true//y轴坐标从0开始
            }
          }]
        }
      }
    }]
  }

});